cf/Documents/ФактическиеДанныеБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ФактическиеДанныеБюджетирования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Бюджетирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики1</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики2</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики3</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ФактическиеДанныеБюджетирования/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьФактНаСервере(ДатаНачала, ДатаОкончания, Отдел);
	
	Объект.Показатели.Загрузить(Документы.ФактическиеДанныеБюджетирования.ПолучитьФактическиеДанные(ДатаНачала, ДатаОкончания, Отдел));
	
КонецФункции

&НаКлиенте
Процедура ПолучитьФакт(Команда)
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) или Не ЗначениеЗаполнено(Объект.ДатаОкончания)  тогда
		ПоказатьПредупреждение(,"Не выбран период!");
		Возврат;
	КонецЕсли;	
	
	Если Объект.Показатели.Количество() Тогда
		Опов = Новый ОписаниеОповещения("ОтветЗаполнитьПоМодели",ЭтаФорма);
		ПоказатьВопрос(Опов,"Таблица не пуста. Удалить имеющиеся данные?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ПолучитьФактНаСервере(Объект.ДатаНачала, Объект.ДатаОкончания, Объект.Отдел);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветЗаполнитьПоМодели(Рез, Парам) Экспорт
	Если рез = КодВозвратаДиалога.Да Тогда
		ПолучитьФактНаСервере(Объект.ДатаНачала, Объект.ДатаОкончания, Объект.Отдел);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПоказателиСтатьяБюджетаПриИзменении(Элемент)
	ТекДанные=Элементы.Показатели.ТекущиеДанные;
	Струк=ПолучитьТипАналитики(ТекДанные.СтатьяБюджета);
	ТекДанные.ТипАналитики1=Струк.ТипАналитики1;
	Элементы.Показатели.ПодчиненныеЭлементы.ПоказателиАналитика1.Доступность=ЗначениеЗаполнено(Струк.ТипАналитики1);
	ТекДанные.типАналитики2=Струк.ТипАналитики2;
	Элементы.Показатели.ПодчиненныеЭлементы.ПоказателиАналитика2.Доступность=ЗначениеЗаполнено(Струк.ТипАналитики2);
	ТекДанные.типАналитики3=Струк.ТипАналитики3;
	Элементы.Показатели.ПодчиненныеЭлементы.ПоказателиАналитика3.Доступность=ЗначениеЗаполнено(Струк.ТипАналитики3);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипАналитики(Статья)
	Возврат Новый Структура("ТипАналитики1,ТипАналитики2,ТипАналитики3",Статья.ТипАналитики1,Статья.ТипАналитики2,Статья.ТипАналитики2);
КонецФункции


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Объект.ДатаНачала=началоМесяца(Объект.ДатаНачала);
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	Объект.ДатаОкончания=КонецМесяца(Объект.ДатаОкончания);
КонецПроцедуры


&НаКлиенте
Процедура ПоказателиПериодПриИзменении(Элемент)
	ТекДанные = Элементы.Показатели.ТекущиеДанные;
	ТекДанные.Период = НачалоМесяца(ТекДанные.Период);
КонецПроцедуры


&НаКлиенте
Процедура ПоказателиСуммаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	текДанные = Элементы.Показатели.ТекущиеДанные;
	Если текДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаНачала, ДатаОкончания, Отдел, СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, текДанные);
	
	СтруктураПараметров.ДатаНачала		= текДанные.Период;
	СтруктураПараметров.ДатаОкончания 	= КонецМесяца(текДанные.Период);
	СтруктураПараметров.Отдел			= Объект.Отдел;
	
	Результат = Новый ТабличныйДокумент;

	ДанныеРасшифровки ="";
	АдресСхемы = "";
	
	ПоказателиСуммаОткрытиеНаСервере(СтруктураПараметров, Результат, ДанныеРасшифровки, АдресСхемы, УникальныйИдентификатор);
	ОткрытьФорму("Документ.ФактическиеДанныеБюджетирования.Форма.ФормаРасшифровки", Новый Структура("Результат, ДанныеРасшифровки, АдресСхемы", Результат, ДанныеРасшифровки, АдресСхемы), ЭтаФорма, Строка(УникальныйИдентификатор) + Строка(Элементы.Показатели.ТекущаяСтрока));
	
КонецПроцедуры

Процедура ПоказателиСуммаОткрытиеНаСервере(СтруктураПараметров, Результат, ДанныеРасшифровки, АдресСхемы, ГУИД)
	
	Документы.ФактическиеДанныеБюджетирования.ОбработкаРасшифровкиФактическойСуммыБюджетирования(СтруктураПараметров, Результат, ДанныеРасшифровки, АдресСхемы, ГУИД);

КонецПроцедуры
